Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Покупка.Ссылка КАК Ссылка ИЗ Документ.Покупка КАК Покупка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйДокумент = Документы.Покупка.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.10');
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Бобтейл");
	НоваяСтрока.Цена = 50;
	НоваяСтрока.Количество = 2;
	НоваяСтрока.Сумма = 100;
	
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Британец");
	НоваяСтрока.Цена = 100;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = 100;
	
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("2");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Британец");
	НоваяСтрока.Цена = 100;
	НоваяСтрока.Количество = 2;
	НоваяСтрока.Сумма = 100; 
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры