
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ОстаткиКотятВКоробках.Записывать = Истина; 
	Движения.СебестоимостьКотят.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.ОстаткиКотятВКоробках.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары); 
		Движение.Период = Дата; 
		
		Движение = Движения.СебестоимостьКотят.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаТовары); 
		Движение.Период = Дата;
		Движение.Себестоимость = ТекСтрокаТовары.Цена;
		
	КонецЦикла;

КонецПроцедуры
