
Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Коробки.Ссылка КАК Ссылка ИЗ Справочник.Коробки КАК Коробки";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйЭлемент = Справочники.Коробки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "1";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.Коробки.СоздатьЭлемент();
	НовыйЭлемент.Наименование = "2";
	НовыйЭлемент.Записать();
	
КонецПроцедуры
