Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Продажа.Ссылка КАК Ссылка ИЗ Документ.Продажа КАК Продажа";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйДокумент = Документы.Продажа.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.19');
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Бобтейл");
	НоваяСтрока.Цена = 200;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = 200;
	
	НоваяСтрока = НовыйДокумент.Товары.Добавить();
	НоваяСтрока.Коробка = Справочники.Коробки.НайтиПоНаименованию("2");
	НоваяСтрока.Порода = Справочники.Породы.НайтиПоНаименованию("Британец");
	НоваяСтрока.Цена = 300;
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Сумма = 300;
		
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры