Процедура СоздатьПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПокупкаКорма.Ссылка КАК Ссылка ИЗ Документ.ПокупкаКорма КАК ПокупкаКорма";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НовыйДокумент = Документы.ПокупкаКорма.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.14');
	НовыйДокумент.Коробка = Справочники.Коробки.НайтиПоНаименованию("1");
	НовыйДокумент.СтоимостьКорма = 75;	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	НовыйДокумент = Документы.ПокупкаКорма.СоздатьДокумент();
	НовыйДокумент.Дата = Дата('2025.03.14');
	НовыйДокумент.Коробка = Справочники.Коробки.НайтиПоНаименованию("2");
	НовыйДокумент.СтоимостьКорма = 30;	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры