
Процедура ОбработкаПроведения(Отказ, Режим)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКотятВКоробкахОстатки.Порода КАК Порода,
		|	ОстаткиКотятВКоробкахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКотятВКоробках.Остатки(&МоментВремени, Коробка = &Коробка) КАК ОстаткиКотятВКоробкахОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ОстаткиКотятВКоробкахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКотятВКоробках.Остатки(&МоментВремени, Коробка = &Коробка) КАК ОстаткиКотятВКоробкахОстатки";
	
	Запрос.УстановитьПараметр("Коробка", Коробка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	РезультатЗапроса = ПакетЗапросов[0].Выбрать();
	ОбщееКоличество = ПакетЗапросов[1].Выбрать();
	
	Если ОбщееКоличество.Следующий() Тогда
		Себестоимость = ?(ОбщееКоличество.КоличествоОстаток = 0, 0, СтоимостьКорма / ОбщееКоличество.КоличествоОстаток)	
	КонецЕсли;
	
	Движения.СебестоимостьКотят.Записывать = Истина;
	
	Пока РезультатЗапроса.Следующий() Цикл
		Движение = Движения.СебестоимостьКотят.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Коробка 		= Коробка;
		Движение.Порода 		= РезультатЗапроса.Порода;
		Движение.Себестоимость 	= Себестоимость;
	КонецЦикла;
	
КонецПроцедуры
